#include <iostream>

int main()
{
	int x = ~0;
	for (int i = 0; i < 32; i++)
	{
		std::cout << ((x<<i)&(1U<<31)?1:0);
	}

	//Biểu diễn số 0:	0000.0000.0000.0000.0000.0000.0000.0000
	//Đảo của số 0:		1111.1111.1111.1111.1111.1111.1111.1111

	//Biểu diễn số 1:	0000.0000.0000.0000.0000.0000.0000.0001
	//Số bù 1 của số 1: 1111.1111.1111.1111.1111.1111.1111.1110
	//Số bù 2 của số 1: 1111.1111.1111.1111.1111.1111.1111.1111
	//Biểu diễn số -1 bằng cách sử dụng số bù 2 của số 1

	system("pause");
	return 0;
}